{"meta":{"title":"前端笔记","subtitle":"What makes a good creator?","description":"记录前端开发学习的点滴，研究好的产品和设计","author":"Kai Jing","url":"https://shuke0327.github.io","root":"/"},"pages":[{"title":"关于本站","date":"2020-04-07T08:41:29.000Z","updated":"2020-04-07T08:52:38.794Z","comments":true,"path":"about/index.html","permalink":"https://shuke0327.github.io/about/index.html","excerpt":"","text":"初衷如果你看到这里，如果你也来自于极客大学的前端训练营，欢迎留个言。 创建这个博客的初衷，是为了记录系统重学前端开发之中的点滴思考，既然需要提交作业和反馈，何不干脆直接做一个博客，将思考和学习过程真实记录下来，长久保存和反思。 有什么新鲜的？我\b的兴趣点主要在于区块链领域，不得不承认，这个领域中成熟的产品很少，而前端交互做得用心的产品，更是少之又少。 另外，金融领域也是我所重点关注的内容，借助于区块链+金融，可以创造出来什么样的新想法，提供给用户？前端开发者的角度去看，区块链行业存在什么样的新奇玩法？ 这可能会是本博客与其他技术博客不同的地方。 除此之外，我是一个野路子土法炼钢的开发者，重新学习前端开发，意味着会有许多的问题需要去仔细思考。同时，从后端开始的开发生涯，或许在角度上面有所不同。 你有什么感兴趣的？一起交流。 欢迎反馈博客右侧可以见到我的联系方式，欢迎一起探讨交流。 不用说，我的视角一定存在偏差，但是，从偏见去看世界，或许是个不同的体验。前端开发学习笔记，我在这里将我的困惑和体验写下来，未必成体系，也未必是你所关注的话题，不过，如果哪怕一百篇之中有一篇能够帮到读者，我也深感荣幸。 学习，动手实战，反思，写作，继续学习。教和写，可能是更好的学习方式。 感谢你的关注和阅读。"}],"posts":[{"title":"成为合格的前端开发者，需要哪些最小必要知识？","slug":"frontend-key-points","date":"2020-04-07T12:20:05.000Z","updated":"2020-04-07T13:10:12.963Z","comments":true,"path":"2020/04/07/frontend-key-points/","link":"","permalink":"https://shuke0327.github.io/2020/04/07/frontend-key-points/","excerpt":"","text":"最小必要知识每个学科都有自己的最小必要知识，前端尽管繁杂，也不例外。 掌握了最小必要知识，并不意味着就能够应对任何的项目需求，只是说，建立起来了基础的框架，能够从这个框架开始展开，让骨架生长出血肉，让前端的开发知识和经验在实践之中积累。 哪些是前端的最小必要知识？前端的全景地图应该是什么样子的？ 问题：如果你要写一本关于整个前端开发的书，目录应该是怎样的？基础篇-高度抽象概览 计算性思维简介 页面元素和布局基础 HTML: 网页基础结构 CSS: 为单调页面增加样式 JavaScript: 让网页动起来，添加基础的元素 浏览器基础：如何看到网页？ 小结：前端这回事 进阶篇-用对工具，解决问题 HTML 的常见场景与问题 CSS 的系统性思维 常见的布局问题和解决方案： HTML + CSS 现代 JavaScript 的编程：模块化思维和实践（Vue/React) 计算机网络基础和浏览器对象模型 前端必备的安全课 架构：面对大的项目如何拆解？ 架构：面对遗留项目，如何理解和快速上手？ 测试：前端测试基础知识 高阶篇-真实世界中的前端技能 问题解决：前端遇到问题，去哪里寻求灵感和高质量答案？ 流行前端框架的核心思想和实战：Vue, React 前端需要知晓的高阶设计模式和数据结构基础 类型思维的 JS 编程能力: TypeScript 前端工具链系统: webpack,Babel,Eslint 等 前端性能优化: 为什么我的 Web App 这么慢？ 前端开发者谈前端：十个顶级开发者的思维方式 总结：前端进行时以上，是关于前端开发我所设想的一份目录，如何尽可能用实践为导向，来学习前端？这个问题，千人千面，答案各有不同。想要成为优秀的前端，需要找到自己的答案。 版本 2020年04月07日21:04:42 第一版","categories":[],"tags":[]}],"categories":[],"tags":[]}